app/Http/Controllers/HomeController.php

    public function __invoke(Request $request): View|Factory|Application
    {
        return view('home', [
            'games' => Game::query()->latest()->paginate(6),
        ]);
---
select * from `games` order by `created_at` desc